{
    "form_1": {
        "name": "Магический квадрат",
        "history": "Магические квадраты являются одними из самых старых методов шифрования. Они были известны еще в древности и использовались в различных культурах для шифрования текстов.",
        "encryption_steps": [
            "Шаг 1: Создать магический квадрат. Присвоить каждой букве или символу в тексте число, соответствующее его позиции в магическом квадрате.",
            "Шаг 2: Заменить символы в тексте на соответствующие числа.",
            "Шаг 3: При необходимости, применить дополнительные алгоритмы шифрования для увеличения степени защиты."
        ],
        "decryption_steps": [
            "Шаг 1: Произвести обратную операцию: заменить числа на символы согласно их позициям в магическом квадрате.",
            "Шаг 2: При необходимости, использовать обратные алгоритмы для расшифровки текста."
        ]
    },
    "form_2": {
        "name": "Квадрат Полибия",
        "history": "Квадрат Полибия был придуман в 5 веке до нашей эры древнегреческим историком и библиографом Николаем Полибием. Он является одним из первых известных примеров использования матрицы для шифрования текста.",
        "encryption_steps": [
            "Шаг 1: Создать алфавит.",
            "Шаг 2: Присвоить каждой букве или символу в тексте пару чисел, соответствующих их координатам в квадрате Полибия."
        ],
        "decryption_steps": [
            "Шаг 1: Используя квадрат Полибия, найти пары чисел и символов.",
            "Шаг 2: Заменить пары чисел на соответствующие символы. Получить последовательность символов"
        ]
    },
    "form_3": {
        "name": "XOR",
        "history": "Операция XOR (исключающее ИЛИ) была впервые использована в криптографии в начале 20 века. Она использует битовую операцию для шифрования данных и остается одним из основных методов шифрования в современных системах безопасности.",
        "encryption_steps": [
            "Шаг 1: Выбрать ключ для операции XOR.",
            "Шаг 2: Применить операцию XOR между каждым символом в тексте и соответствующими битами ключа."
        ],
        "decryption_steps": [
            "Шаг 1: Применить операцию XOR между зашифрованным текстом и ключом."
        ]
    }
}
